In [1]:
%matplotlib inline

import numpy as np
import matplotlib.pyplot as plt 
import pandas as pd

In [2]:
df = pd.read_csv("grades.csv")

In [3]:
df.head()

    姓名  國文  英文  數學  自然  社會
0  劉俊安   9  10  15  10  13
1  胡玉華  10  10  10   8   9
2  黃淑婷  13  15   8  11  14
3  陳上紫  10  10   8   9  14
4  崔靜成  13  12  14  12  13

In [4]:
df.國文.mean()

11.39

In [5]:
df.國文.std()

2.1968526614594834

In [6]:
df.describe()

               國文          英文          數學         自然         社會
count  100.000000  100.000000  100.000000  100.00000  100.00000
mean    11.390000   11.380000   11.570000   11.03000   11.83000
std      2.196853    2.273164    2.310516    2.21772    2.48655
min      8.000000    8.000000    8.000000    8.00000    8.00000
25%      9.000000    9.000000   10.000000    9.00000    9.00000
50%     11.000000   11.000000   11.000000   11.00000   12.00000
75%     13.000000   13.000000   14.000000   13.00000   14.00000
max     15.000000   15.000000   15.000000   15.00000   15.00000

In [7]:
df.corr()

          國文        英文        數學        自然        社會
國文  1.000000  0.160158 -0.310899 -0.110236 -0.028421
英文  0.160158  1.000000  0.025656  0.113929 -0.063512
數學 -0.310899  0.025656  1.000000  0.014371  0.041651
自然 -0.110236  0.113929  0.014371  1.000000 -0.156594
社會 -0.028421 -0.063512  0.041651 -0.156594  1.000000

In [9]:
df.國文.corr(df.數學)

-0.3108989822179331

In [10]:
df["總級分"] = df[["國文","英文","數學","自然","社會"]].sum(1)

In [11]:
df.head()

    姓名  國文  英文  數學  自然  社會  總級分
0  劉俊安   9  10  15  10  13   57
1  胡玉華  10  10  10   8   9   47
2  黃淑婷  13  15   8  11  14   61
3  陳上紫  10  10   8   9  14   51
4  崔靜成  13  12  14  12  13   64

In [12]:
df["加權"] = df.數學*1.5 + df.英文

In [13]:
df.head()

    姓名  國文  英文  數學  自然  社會  總級分    加權
0  劉俊安   9  10  15  10  13   57  32.5
1  胡玉華  10  10  10   8   9   47  25.0
2  黃淑婷  13  15   8  11  14   61  27.0
3  陳上紫  10  10   8   9  14   51  22.0
4  崔靜成  13  12  14  12  13   64  33.0